CSI API ETABS v1
cDStEN1993_1_1_2022 Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDStEN1993_1_1_2022
Public Interface cDStEN1993_1_1_2022
Dim instance As cDStEN1993_1_1_2022
public interface class cDStEN1993_1_1_2022
type cDStEN1993_1_1_2022 =  interface end
The cDStEN1993_1_1_2022 type exposes the following members.
Methods
Name | Description
GetOverwrite
 Retrieves the value of a steel design overwrite item
GetPreference
 Retrieves the value of a steel design preference item.
SetOverwrite
 Sets the value of a steel design overwrite item
SetPreference
 Sets the value of a steel design preference item.
Top
See Also
Reference
ETABSv1 Namespace